#格式化字符串
#(1)%
'''%s代替字符串,%i或%d代替整数,%f代替浮点数'''
name='张三'
age=20
print('我叫%s,今年%d岁'%(name,age))
#(2)使用{}表示占位符
print('我叫{0},今年岁{1}'.format(name,age))

#(3)f-string
print('我叫{name}，今年{age}岁')

print("%d" % 99)
print("%10d" % 99)#10表示的是宽度

print('%.3f'% 3.1415926)#.3表示保留三位小数
#可以同时表示宽度和精度
print('%10.3f'% 3.1415926)

print('{0}'.format(3.1415926))
print('{0:.3}'.format(3.1415926))#表示的是一共是三个数
print('{0:.3f}'.format(3.1415926))#.3f表示三位小数
print('{0:10.3f}'.format(3.1415926))#宽度10，精度小数点后三位